{
  "metadata": {
    "version": "1.0",
    "description": "Définition des Signes mystiques, pouvoirs spéciaux utilisables par le joueur",
    "lastUpdated": "2025-04-25"
  },
  "signs_categories": [
    {
      "id": "traditional",
      "name": "Signes Traditionnels",
      "description": "Signes enseignés officiellement par l'Académie des Signes, considérés comme sûrs et éthiques.",
      "legality": "Légal",
      "difficulty": "Variable",
      "source": "Académie des Signes"
    },
    {
      "id": "forbidden",
      "name": "Signes Interdits",
      "description": "Signes bannis par l'Académie en raison de leur nature dangereuse, de leur coût élevé ou de leur potentiel de corruption.",
      "legality": "Illégal",
      "difficulty": "Élevée",
      "source": "Adorateurs de l'Essence, textes anciens"
    },
    {
      "id": "spiritual",
      "name": "Signes Spirituels",
      "description": "Signes liés à la communication avec les esprits et le monde immatériel, pratiqués par les chamanes.",
      "legality": "Toléré dans certaines régions",
      "difficulty": "Moyenne",
      "source": "Gardiens du Flux, traditions tribales"
    },
    {
      "id": "combat",
      "name": "Signes de Combat",
      "description": "Signes développés spécifiquement pour améliorer les capacités de combat des variants ou du Tacticien.",
      "legality": "Légal avec restrictions",
      "difficulty": "Variable",
      "source": "Guildes de Guerriers, Clan Blackthorn"
    },
    {
      "id": "experimental",
      "name": "Signes Expérimentaux",
      "description": "Signes nouvellement développés par des chercheurs, combinant science et mystique.",
      "legality": "Zone grise",
      "difficulty": "Très élevée",
      "source": "Illuminés Biologiques, chercheurs indépendants"
    }
  ],
  "mystical_signs": [
    {
      "id": "ombre",
      "name": "Signe de l'Ombre",
      "category": "combat",
      "description": "Un signe qui permet au Tacticien et à son variant de se fondre dans les ombres, devenant presque invisibles.",
      "lore": "Développé à l'origine par des Tacticiens espions pendant les anciennes guerres, ce signe a été perfectionné par le Clan Blackthorn pour leurs opérations clandestines.",
      "effect": "Réduit considérablement la détectabilité du Tacticien et de son variant actif pendant 60 secondes. Augmente les chances de fuite en combat et permet de se déplacer sans être repéré par les PNJ hostiles.",
      "cost": "30 points d'énergie",
      "cooldown": "5 minutes",
      "teacher": "Soren Blackthorn",
      "quest_requirement": 201,
      "reputation_requirement": {"faction": "Blackthorn Clan", "level": "Respecté"},
      "risks": "Utilisation prolongée peut causer une légère désorientation et une sensibilité accrue à la lumière pendant quelques heures."
    },
    {
      "id": "silence",
      "name": "Signe du Silence",
      "category": "combat",
      "description": "Un signe qui étouffe tous les sons émis par le Tacticien et son variant, permettant des déplacements parfaitement silencieux.",
      "lore": "Créé par les chasseurs de variants nocturnes qui avaient besoin d'approcher leurs proies sans les alerter.",
      "effect": "Supprime tous les sons émis par le joueur et son variant pendant 30 secondes. Augmente les chances de réussir une attaque surprise.",
      "cost": "25 points d'énergie",
      "cooldown": "3 minutes",
      "teacher": "Varis Shadowblade",
      "quest_requirement": 216,
      "reputation_requirement": {"faction": "Blackthorn Clan", "level": "Allié"},
      "risks": "Peut temporairement affecter la capacité du variant à utiliser des attaques sonores."
    },
    {
      "id": "perception",
      "name": "Signe de la Perception",
      "category": "spiritual",
      "description": "Un signe qui aiguise les sens du Tacticien, lui permettant de percevoir des détails normalement invisibles et de sentir la présence de variants cachés.",
      "lore": "Développé par les premiers chamanes pour communiquer avec le monde spirituel, ce signe a été adapté pour la chasse aux variants rares.",
      "effect": "Révèle les variants cachés dans un rayon de 50 mètres, montre leur type et leur rareté. Permet également de voir des indices invisibles liés aux quêtes.",
      "cost": "20 points d'énergie",
      "cooldown": "2 minutes",
      "teacher": "Aria Moonshadow ou Soren Blackthorn",
      "quest_requirement": 204,
      "reputation_requirement": {"faction": "Gardiens du Flux", "level": "Ami de la Forêt"},
      "risks": "Surcharge sensorielle possible si utilisé dans des zones très peuplées de variants."
    },
    {
      "id": "sang",
      "name": "Signe du Sang",
      "category": "forbidden",
      "description": "Un signe puissant et dangereux qui crée un lien vital entre le Tacticien et son variant, leur permettant de partager force et faiblesse.",
      "lore": "Interdit par l'Académie après plusieurs incidents où des Tacticiens ont perdu le contrôle ou ont été consumés par le lien. Les Adorateurs de l'Essence le considèrent comme le signe le plus sacré.",
      "effect": "Crée un lien profond avec le variant actif. Le Tacticien peut transférer jusqu'à 30% de sa santé au variant et vice versa. Les dégâts sont partiellement partagés. Les statistiques du variant sont augmentées de 40% pendant la durée du lien.",
      "cost": "50 points d'énergie + 10% de santé maximale",
      "duration": "3 minutes",
      "cooldown": "24 heures",
      "teacher": "Lyra Nightshade",
      "quest_requirement": 202,
      "reputation_requirement": {"faction": "Adorateurs de l'Essence", "level": "Adepte"},
      "risks": "Risque de dépendance psychique au lien. Si le variant meurt pendant que le lien est actif, le Tacticien subit des dégâts massifs et peut tomber dans le coma."
    },
    {
      "id": "ame",
      "name": "Signe de l'Âme",
      "category": "forbidden",
      "description": "Un signe qui permet de communiquer directement avec l'essence d'un variant, comprenant ses pensées et ses émotions.",
      "lore": "Ce signe révèle la véritable nature des variants comme des êtres conscients et complexes, ce qui menace le paradigme des Tacticiens qui les considèrent comme de simples outils.",
      "effect": "Établit une communication télépathique avec un variant (même sauvage) pendant 5 minutes. Permet de comprendre ses intentions, de négocier, et augmente considérablement les chances de capture volontaire.",
      "cost": "40 points d'énergie",
      "cooldown": "12 heures",
      "teacher": "Lyra Nightshade",
      "quest_requirement": 219,
      "reputation_requirement": {"faction": "Adorateurs de l'Essence", "level": "Illuminé"},
      "risks": "Exposition aux émotions et souvenirs potentiellement traumatisants du variant. Peut causer une empathie excessive qui rend difficile l'utilisation des variants en combat."
    },
    {
      "id": "resonance",
      "name": "Signe de la Résonance",
      "category": "forbidden",
      "description": "Un signe qui amplifie considérablement les capacités naturelles d'un variant en puisant dans l'énergie vitale du Tacticien.",
      "lore": "Créé par des Tacticiens désespérés lors d'anciennes guerres, ce signe a été interdit après que plusieurs utilisateurs se soient littéralement consumés pour donner à leurs variants une puissance dévastatrice.",
      "effect": "Augmente toutes les statistiques du variant actif de 100% pendant 1 minute. Chaque attaque du variant pendant cette période coûte 5% de la santé maximale du Tacticien.",
      "cost": "60 points d'énergie + 20% de santé maximale",
      "cooldown": "3 jours",
      "teacher": "Elias Voidwalker",
      "quest_requirement": 219,
      "reputation_requirement": {"faction": "Adorateurs de l'Essence", "level": "Illuminé"},
      "risks": "Risque élevé d'épuisement vital. L'utilisation répétée peut causer des dommages permanents à la santé du Tacticien. Peut provoquer une frénésie chez le variant qui devient temporairement incontrôlable."
    },
    {
      "id": "communion",
      "name": "Signe de Communion",
      "category": "spiritual",
      "description": "Un signe qui permet de communiquer brièvement avec l'esprit d'un variant décédé.",
      "lore": "Pratiqué depuis des millénaires par les chamanes des Gardiens du Flux, ce signe est considéré comme sacré et n'est enseigné qu'à ceux qui respectent profondément les variants.",
      "effect": "Permet d'invoquer et de communiquer avec l'esprit d'un variant décédé pendant 3 minutes. Peut révéler des informations sur son passé, des secrets ou des emplacements cachés.",
      "cost": "35 points d'énergie",
      "cooldown": "3 jours",
      "teacher": "Aria Moonshadow",
      "quest_requirement": 204,
      "reputation_requirement": {"faction": "Gardiens du Flux", "level": "Allié Spirituel"},
      "risks": "Peut attirer d'autres esprits non désirés. L'esprit peut être hostile si le variant a souffert avant sa mort."
    },
    {
      "id": "apaisement",
      "name": "Signe d'Apaisement",
      "category": "spiritual",
      "description": "Un signe qui calme les variants agités et soigne leurs blessures spirituelles.",
      "lore": "Utilisé par les Gardiens du Flux pour aider les variants traumatisés par des combats ou des mauvais traitements.",
      "effect": "Apaise un variant sauvage agressif, augmentant les chances de fuite ou de capture. Soigne les conditions de statut négatifs des variants alliés et restaure 30% de leur santé.",
      "cost": "25 points d'énergie",
      "cooldown": "30 minutes",
      "teacher": "Echo Dreamwalker",
      "quest_requirement": 211,
      "reputation_requirement": {"faction": "Gardiens du Flux", "level": "Ami de la Forêt"},
      "risks": "Minimal, mais peut temporairement réduire la puissance offensive du variant allié."
    },
    {
      "id": "invocation",
      "name": "Signe d'Invocation",
      "category": "spiritual",
      "description": "Un signe qui appelle temporairement l'aide d'un esprit variant.",
      "lore": "Une pratique ancienne des Gardiens du Flux, considérée avec méfiance par l'Académie qui la voit comme une forme de nécromancie.",
      "effect": "Invoque un esprit variant qui combat aux côtés du joueur pendant 2 minutes. Le type et la puissance de l'esprit dépendent du lieu d'invocation et de la réputation du joueur auprès des Gardiens.",
      "cost": "45 points d'énergie",
      "cooldown": "12 heures",
      "teacher": "Aria Moonshadow",
      "quest_requirement": 212,
      "reputation_requirement": {"faction": "Gardiens du Flux", "level": "Gardien Honoraire"},
      "risks": "L'esprit peut occasionnellement se rebeller s'il n'est pas traité avec respect. L'invocation dans des lieux impurs peut attirer des esprits malveillants."
    },
    {
      "id": "analyse",
      "name": "Signe d'Analyse",
      "category": "experimental",
      "description": "Un signe qui permet d'analyser en profondeur les faiblesses d'un variant ennemi.",
      "lore": "Développé par les Illuminés Biologiques en combinant des connaissances scientifiques sur l'anatomie des variants avec des principes mystiques.",
      "effect": "Révèle toutes les statistiques, faiblesses et résistances d'un variant ennemi. Augmente les dégâts infligés à ce variant de 25% pendant 1 minute.",
      "cost": "20 points d'énergie",
      "cooldown": "1 minute",
      "teacher": "Professeur Thaddeus Grimm",
      "quest_requirement": 205,
      "reputation_requirement": {"faction": "Illuminés Biologiques", "level": "Assistant"},
      "risks": "Minimal, mais l'utilisation fréquente peut créer une dépendance aux données analytiques, réduisant l'intuition naturelle du Tacticien."
    },
    {
      "id": "adaptation",
      "name": "Signe d'Adaptation",
      "category": "experimental",
      "description": "Un signe qui modifie temporairement le type élémentaire d'un variant pour l'adapter à la situation.",
      "lore": "Une innovation controversée des Illuminés Biologiques, considérée comme une manipulation contre-nature par les traditionalistes.",
      "effect": "Change le type élémentaire secondaire du variant actif pendant 5 minutes, lui permettant de s'adapter aux faiblesses de l'adversaire.",
      "cost": "30 points d'énergie",
      "cooldown": "6 heures",
      "teacher": "Dr. Mira Vivisect",
      "quest_requirement": 214,
      "reputation_requirement": {"faction": "Illuminés Biologiques", "level": "Chercheur Associé"},
      "risks": "Peut causer une confusion d'identité chez le variant, réduisant temporairement sa loyauté. Utilisation répétée peut entraîner des mutations imprévisibles."
    },
    {
      "id": "symbiose",
      "name": "Signe de Symbiose",
      "category": "experimental",
      "description": "Un signe qui permet au Tacticien de partager temporairement des capacités avec son variant.",
      "lore": "Le résultat de décennies de recherche des Illuminés Biologiques sur la fusion des essences humaines et variants.",
      "effect": "Le Tacticien gagne une capacité basée sur le type de son variant actif pendant 3 minutes (résistance au feu, respiration sous l'eau, etc.). Le variant gagne en retour une capacité humaine (raisonnement tactique amélioré, utilisation d'objets, etc.).",
      "cost": "40 points d'énergie",
      "cooldown": "12 heures",
      "teacher": "Professeur Thaddeus Grimm",
      "quest_requirement": 205,
      "reputation_requirement": {"faction": "Illuminés Biologiques", "level": "Illuminé"},
      "risks": "Risque de fusion mentale partielle. Le Tacticien peut temporairement adopter des comportements de variant, et vice versa. Rarement, le processus peut être difficile à inverser."
    },
    {
      "id": "blood_bond_major",
      "name": "Lien de Sang Majeur",
      "category": "forbidden",
      "description": "Une version avancée du Signe du Sang, créant un lien permanent et profond avec un variant spécifique.",
      "lore": "Le plus puissant et le plus dangereux des Signes Interdits, considéré comme une hérésie absolue par l'Académie des Signes.",
      "effect": "Crée un lien permanent avec un variant choisi. Le variant gagne 50% de statistiques supplémentaires et une régénération accélérée. Le Tacticien peut utiliser une version limitée des capacités du variant. Les deux partagent douleur et blessures.",
      "cost": "Rituel spécial + sacrifice permanent de 10% de santé maximale",
      "duration": "Permanent",
      "teacher": "Lyra Nightshade",
      "quest_requirement": 202,
      "reputation_requirement": {"faction": "Adorateurs de l'Essence", "level": "Illuminé"},
      "risks": "Si le variant meurt, le Tacticien subit un traumatisme psychique sévère et peut perdre temporairement toutes ses capacités. Le lien ne peut être rompu qu'à travers un rituel complexe et douloureux."
    },
    {
      "id": "blood_control",
      "name": "Contrôle Sanguin",
      "category": "forbidden",
      "description": "Une variante sombre du Signe du Sang qui permet de contrôler totalement un variant sauvage.",
      "lore": "Une perversion du Signe du Sang original, développée par des Tacticiens corrompus cherchant à dominer plutôt qu'à coopérer.",
      "effect": "Permet de prendre le contrôle total d'un variant sauvage pendant 5 minutes, le forçant à obéir à tous les ordres. Augmente considérablement les chances de capture après utilisation.",
      "cost": "40 points d'énergie + sacrifice d'un petit variant",
      "cooldown": "3 jours",
      "teacher": "Lyra Nightshade (à contrecœur)",
      "quest_requirement": 202,
      "reputation_requirement": {"faction": "Adorateurs de l'Essence", "level": "Adepte"},
      "risks": "Corrompt progressivement le Tacticien, diminuant sa réputation auprès des factions spirituelles. Les variants contrôlés peuvent développer une haine durable envers le Tacticien."
    },
    {
      "id": "blood_bond_minor",
      "name": "Lien de Sang Mineur",
      "category": "forbidden",
      "description": "Une version modérée du Signe du Sang, créant un lien temporaire mais puissant avec un variant.",
      "lore": "Développé par Lyra comme une alternative plus sûre au Signe du Sang complet, pour ceux qui ne sont pas prêts à faire le sacrifice ultime.",
      "effect": "Crée un lien temporaire avec le variant actif pendant 10 minutes. Les statistiques du variant augmentent de 30%, et le Tacticien peut ressentir ses émotions. Les dégâts sont partiellement partagés.",
      "cost": "35 points d'énergie + réduction temporaire des statistiques de 15% pendant 3 jours",
      "cooldown": "7 jours",
      "teacher": "Lyra Nightshade ou Selene Moonwhisper",
      "quest_requirement": 202,
      "reputation_requirement": {"faction": "Adorateurs de l'Essence", "level": "Initié"},
      "risks": "Fatigue prolongée après utilisation. Peut créer une dépendance psychologique légère au lien."
    }
  ]
}
